{
  "regionsInfrastructure": {
    "title": "Régions et infrastructure"
  },
  "architecture": {
    "title": "Architecture de l'entreprise",
    "fetchError": "Échec de la récupération des données d'architecture",
    "noData": "Aucune donnée d'architecture disponible",
    "viewHierarchy": "Hiérarchie",
    "viewForce": "Force",
    "viewRadial": "Radial",
    "legend": "Légende",
    "users": "Utilisateurs",
    "teams": "Équipes",
    "machines": "Machines",
    "regions": "Régions",
    "bridges": "Ponts",
    "repositories": "Référentiels",
    "schedules": "Planifications",
    "storages": "Stockages",
    "nodeCompany": "Entreprise",
    "nodeUser": "Utilisateur",
    "nodeTeam": "Équipe",
    "nodeRegion": "Région",
    "nodeBridge": "Pont",
    "nodeMachine": "Machine",
    "nodeRepository": "Référentiel",
    "nodeSchedule": "Planification",
    "nodeStorage": "Stockage",
    "filterEntities": "Filtrer les entités",
    "selectEntities": "Sélectionner les types d'entités à afficher",
    "selectAll": "Tout sélectionner",
    "clearAll": "Tout effacer",
    "noEntitiesSelected": "Aucune entité sélectionnée. Veuillez sélectionner au moins un type d'entité à afficher."
  },
  "dangerZone": {
    "title": "Zone de danger",
    "blockUserRequests": {
      "title": "Bloquer les requêtes utilisateur",
      "description": "Bloquer tous les utilisateurs non administrateurs de faire des requêtes au système. Cela mettra immédiatement fin à toutes les sessions utilisateur actives sauf les administrateurs. Les utilisateurs devront être débloqués manuellement pour retrouver l'accès.",
      "blockButton": "Bloquer les requêtes utilisateur",
      "unblockButton": "Débloquer les requêtes utilisateur",
      "confirmBlock": {
        "title": "Bloquer les requêtes utilisateur",
        "description": "Cette action va :",
        "effect1": "Bloquer tous les utilisateurs non administrateurs du système",
        "effect2": "Terminer toutes les sessions utilisateur actives (sauf administrateurs)",
        "effect3": "Nécessiter un déblocage manuel pour que les utilisateurs retrouvent l'accès",
        "confirm": "Êtes-vous sûr de vouloir continuer ?",
        "okText": "Oui, bloquer les utilisateurs"
      },
      "confirmUnblock": {
        "title": "Débloquer les requêtes utilisateur",
        "description": "Cela permettra à tous les utilisateurs de faire à nouveau des requêtes au système. Êtes-vous sûr ?",
        "okText": "Oui, débloquer"
      }
    },
    "exportVaults": {
      "title": "Exporter tous les coffres-forts",
      "description": "Télécharger toutes les configurations de coffre-fort de l'entreprise incluant les équipes, régions, ponts, machines, référentiels, stockage et planifications. Cet export contient des informations d'identification sensibles et doit être manipulé de manière sécurisée.",
      "button": "Exporter tous les coffres-forts",
      "success": "Coffres-forts exportés avec succès",
      "error": "Échec de l'exportation des coffres-forts"
    },
    "updateMasterPassword": {
      "title": "Paramètres du mot de passe de chiffrement",
      "description": "Configurer le mot de passe de chiffrement côté client qui protège toutes les données sensibles du coffre-fort dans votre organisation. Ce mot de passe est partagé entre tous les utilisateurs et n'est jamais accessible à Rediacc pour une sécurité renforcée.",
      "effect1": "Re-chiffrer tous les coffres-forts avec le nouveau mot de passe",
      "effect2": "Déconnecter tous les utilisateurs (sauf vous)",
      "effect3": "Exiger que tous les utilisateurs se reconnectent après l'achèvement",
      "warning": "Stockez le nouveau mot de passe dans un endroit sécurisé - il ne peut pas être récupéré s'il est perdu.",
      "button": "Paramètres de chiffrement",
      "modal": {
        "title": "Configuration du mot de passe de chiffrement",
        "operationType": "Sélectionner l'opération",
        "operationCreate": "Créer un mot de passe principal",
        "operationUpdate": "Mettre à jour le mot de passe principal",
        "operationRemove": "Supprimer le mot de passe principal",
        "warningTitle": "⚠️ Opération de sécurité critique",
        "warningDescription": "Vous êtes sur le point de modifier le mot de passe principal pour toute votre entreprise. Cela va :",
        "warningDescriptionCreate": "Vous êtes sur le point de créer un mot de passe principal pour toute votre entreprise. Cela va :",
        "warningDescriptionUpdate": "Vous êtes sur le point de mettre à jour le mot de passe principal pour toute votre entreprise. Cela va :",
        "warningDescriptionRemove": "Vous êtes sur le point de supprimer le mot de passe principal pour toute votre entreprise. Cela va :",
        "warningEffect1": "Verrouiller temporairement le système pendant l'opération",
        "warningEffect2": "Déconnecter tous les utilisateurs actifs sauf vous",
        "warningEffect3": "Re-chiffrer toutes les données du coffre-fort avec le nouveau mot de passe",
        "warningEffect3Create": "Chiffrer toutes les données du coffre-fort avec le mot de passe principal",
        "warningEffect3Update": "Re-chiffrer toutes les données du coffre-fort avec le nouveau mot de passe",
        "warningEffect3Remove": "Déchiffrer toutes les données du coffre-fort (les coffres-forts seront stockés non chiffrés)",
        "warningEffect4": "Nécessiter une reconfiguration manuelle de tous les ponts",
        "warningPermanent": "Cette action est permanente et ne peut pas être annulée.",
        "warningSecure": "Avez-vous stocké votre nouveau mot de passe de manière sécurisée ?",
        "warningSecureRemove": "Êtes-vous sûr de vouloir supprimer le chiffrement de tous les coffres-forts ?",
        "newPasswordLabel": "Nouveau mot de passe principal",
        "newPasswordPlaceholder": "Entrez le nouveau mot de passe principal",
        "newPasswordRequired": "Veuillez entrer le nouveau mot de passe principal",
        "newPasswordMinLength": "Le mot de passe doit contenir au moins 12 caractères",
        "newPasswordPattern": "Le mot de passe doit contenir des majuscules, minuscules, chiffres et caractères spéciaux",
        "confirmPasswordLabel": "Confirmer le mot de passe principal",
        "confirmPasswordPlaceholder": "Confirmer le nouveau mot de passe principal",
        "confirmPasswordRequired": "Veuillez confirmer le mot de passe principal",
        "confirmPasswordMatch": "Les mots de passe ne correspondent pas",
        "importantNote": "Après la mise à jour du mot de passe de chiffrement, tous les utilisateurs devront utiliser le nouveau mot de passe partagé pour accéder aux configurations du coffre-fort. Ce mot de passe doit être distribué de manière sécurisée à tous les utilisateurs autorisés. Note : Les ponts globaux avec RequestCredential devront être débloqués manuellement.",
        "importantNoteCreate": "Après la création du mot de passe de chiffrement, tous les utilisateurs auront besoin de ce mot de passe partagé pour accéder aux configurations du coffre-fort. Distribuez-le de manière sécurisée à tous les membres autorisés de l'entreprise - Rediacc n'a pas accès à ce mot de passe.",
        "importantNoteRemove": "Après la suppression du mot de passe de chiffrement, les configurations du coffre-fort seront accessibles sans chiffrement côté client. Considérez les implications de sécurité pour vos données sensibles.",
        "cancel": "Annuler",
        "submit": "Exécuter l'opération",
        "submitCreate": "Créer le mot de passe de chiffrement",
        "submitUpdate": "Mettre à jour le mot de passe de chiffrement",
        "submitRemove": "Supprimer le mot de passe de chiffrement"
      },
      "success": {
        "title": "Opération terminée avec succès",
        "titleCreate": "Mot de passe de chiffrement créé avec succès",
        "titleUpdate": "Mot de passe de chiffrement mis à jour avec succès",
        "titleRemove": "Mot de passe de chiffrement supprimé avec succès",
        "nextSteps": "Prochaines étapes :",
        "step1": "Tous les utilisateurs doivent se reconnecter en utilisant leurs identifiants existants",
        "step2": "Partagez le nouveau mot de passe de chiffrement de manière sécurisée avec tous les utilisateurs autorisés de votre organisation",
        "step2Remove": "Informez les administrateurs que les coffres-forts sont maintenant non chiffrés",
        "step3": "Vos propres ponts doivent être reconfigurés manuellement avec le nouveau mot de passe de chiffrement",
        "step3Remove": "Vos propres ponts doivent être reconfigurés manuellement sans chiffrement côté client",
        "step4": "Mettez à jour le système de gestion des mots de passe de votre entreprise avec le nouveau mot de passe de chiffrement partagé",
        "step4Remove": "Supprimez le mot de passe de chiffrement du système de gestion des mots de passe de votre entreprise",
        "systemReady": "Le système est maintenant déverrouillé et prêt à l'emploi.",
        "redirecting": "Redirection vers la page de connexion dans",
        "seconds": "secondes",
        "loginNow": "Aller à la connexion maintenant"
      },
      "error": {
        "fetchVaults": "Échec de la récupération des coffres-forts actuels",
        "noVaults": "Aucun coffre-fort trouvé à mettre à jour",
        "updateFailed": "Échec de la mise à jour des coffres-forts avec le nouveau mot de passe de chiffrement",
        "partialSuccess": "{{updated}} coffres-forts mis à jour avec succès, mais {{failed}} ont échoué. Vérifiez les journaux pour plus de détails."
      }
    }
  },
  "userSessions": {
    "title": "Sessions utilisateur",
    "totalSessions": "Total des sessions",
    "activeSessions": "Sessions actives",
    "uniqueUsers": "Utilisateurs uniques",
    "averageDuration": "Durée moyenne",
    "minutes": "minutes",
    "searchPlaceholder": "Rechercher par email, IP ou nom de session...",
    "totalCount": "Total : {{count}} sessions",
    "currentSession": "Vous",
    "active": "Active",
    "inactive": "Inactive",
    "terminate": "Terminer",
    "confirmTerminate": "Terminer la session",
    "confirmTerminateSelf": "Ceci est votre session actuelle. La terminer vous déconnectera. Êtes-vous sûr ?",
    "confirmTerminateOther": "Êtes-vous sûr de vouloir terminer la session pour {{email}} ?",
    "selfTerminateWarning": "Votre session sera terminée. Vous devrez vous reconnecter.",
    "columns": {
      "user": "Utilisateur",
      "sessionName": "Session",
      "ipAddress": "Adresse IP",
      "userAgent": "Agent utilisateur",
      "status": "Statut",
      "createdAt": "Heure de connexion",
      "lastActivity": "Dernière activité",
      "duration": "Durée",
      "actions": "Actions"
    }
  }
}